app/views/students/_form.html.erb

SELECT `costs`.* FROM `costs`
---
        <%= f.label "收费请况" %><br>
        <%= f.select :cost_id, options_for_select(Cost.all.map{|cost| ["#{cost.name}:#{cost.price}", cost.id] } ) %>