app/views/students/index.html.erb

SELECT `costs`.* FROM `costs` WHERE `costs`.`id` = 3 LIMIT 1
---
                <td><%= student.active? ? "在读" : "已离校" %>
                <td><%= "#{Cost.find(student.cost_id).name }:#{Cost.find(student.cost_id).price }" if student.cost_id %>