app/controllers/costs_controller.rb

  def index
    @costs = Cost.paginate(:page => params[:page], :per_page => params[:per_page] || 20)
---
SELECT `costs`.* FROM `costs` LIMIT 20 OFFSET 0

  def create
    @cost = Cost.new(cost_params)

    respond_to do |format|
      if @cost.save
---
INSERT INTO `costs` (`created_at`, `name`, `price`, `student_id`, `updated_at`) VALUES ('2014-08-13 04:32:27', 'èˆžè¹ˆä¸€çº§æ”¶è´¹', 11211313, 1, '2014-08-13 04:32:27')

  def update
    respond_to do |format|
      if @cost.update(cost_params)
---
UPDATE `costs` SET `price` = 1000, `updated_at` = '2014-08-13 05:30:06' WHERE `costs`.`id` = 1

    def set_cost
      @cost = Cost.find(params[:id])
---
SELECT `costs`.* FROM `costs` WHERE `costs`.`id` = 1 LIMIT 1