app/controllers/students_controller.rb

SELECT COUNT(*) FROM `students` WHERE (id)
SELECT `students`.* FROM `students` WHERE (id) ORDER BY `students`.`created_at` DESC LIMIT 5 OFFSET 0
---
  def index
    params[:where].blank? ? @students = Student.all : @students = Student.where("#{params[:where]}" => params[:keyword])
    @students = @students.paginate(:page => params[:page], :per_page => params[:per_page] || 5)

INSERT INTO `students` (`address`, `birthday`, `card_number`, `cost_id`, `created_at`, `gender`, `mail`, `mobile`, `name`, `parent_name`, `updated_at`) VALUES ('åŒ—äº¬å¸‚æœé˜³åŒºæœé˜³åŒ—è·¯', '1988-05-28', 6, 1, '2014-08-13 06:10:26', 'å¥³', '287715007@qq.com', '13466759733', 'å±ˆä¸¹', 'å­™è¯‘æ¶µ', '2014-08-13 06:10:26')
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE `students` SET `birthday` = '1988-05-28', `card_number` = 5, `mail` = 'shshshsh@qq.com', `address` = 'åŒ—äº¬å¸‚æœé˜³åŒºæœé˜³åŒ—è·¯', `cost_id` = 1, `updated_at` = '2014-08-13 06:15:00' WHERE `students`.`id` = 5
---
  def update
    respond_to do |format|
      if @student.update(student_params)

DELETE FROM `students` WHERE `students`.`id` = 6
---
  def destroy
    @student.destroy

SELECT `students`.* FROM `students` ORDER BY `students`.`created_at` DESC
---
  def export
    @students = Student.all

SELECT `students`.* FROM `students` WHERE `students`.`id` = 6 ORDER BY `students`.`created_at` DESC LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])