app/controllers/teacher_signs_controller.rb

  def index
    @teacher_signs = TeacherSign.all
---
SELECT `teacher_signs`.* FROM `teacher_signs`

  def create
    @teacher_sign = TeacherSign.new(teacher_sign_params)
    @teacher_sign.save
---
INSERT INTO `teacher_signs` (`course_name`, `created_at`, `date`, `teacher_name`, `updated_at`) VALUES ('å½¢ä½“è¯¾', '2014-10-08 06:43:43', '2014-10-08 06:43:00', 'å¼ å©·', '2014-10-08 06:43:43')

  def export
    @teacher_signs = TeacherSign.all
---
SELECT `teacher_signs`.* FROM `teacher_signs`

    def set_teacher_sign
      @teacher_sign = TeacherSign.find(params[:id])
---
SELECT `teacher_signs`.* FROM `teacher_signs` WHERE `teacher_signs`.`id` = 1 LIMIT 1