app/controllers/test_courses_controller.rb

SELECT `test_courses`.* FROM `test_courses`
---
  def index
    @test_courses = TestCourse.all

INSERT INTO `test_courses` (`course_name`, `created_at`, `student_name`, `updated_at`) VALUES ('èˆžè¹ˆè¯¾1', '2014-10-08 06:42:36', 'å­™è´ž', '2014-10-08 06:42:36')
---
  def create
    @test_course = TestCourse.new(test_course_params)
    @test_course.save

SELECT `test_courses`.* FROM `test_courses` WHERE `test_courses`.`id` = 1 LIMIT 1
---
    def set_test_course
      @test_course = TestCourse.find(params[:id])